Autodesk.Revit.DB.Settings.TilePatterns
Retrieves an object that provides access to the TilePattern objects in
the document.

Autodesk.Revit.DB.Settings.ElectricalSetting
Retrieves an object that provides access to all the electrical settings include voltage type, distribution system type,
demand factor, wire type in the Autodesk Revit application and project.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Electrical settings can be accessed only if Revit MEP product is available.

Autodesk.Revit.DB.Settings.Categories
Retrieves an object that provides access to all the categories contained in the Autodesk
Revit application and project.

Autodesk.Revit.DB.Settings
The settings object provides access to general components of the Autodesk Revit
application, such as Categories.